


Geopriv                                                    H. Tschofenig
Internet-Draft                                                   Siemens
Expires: September 7, 2006                                    F. Adrangi
                                                                   Intel
                                                                M. Jones
                                                                 A. Lior
                                                             Bridgewater
                                                           March 6, 2006


                  Carrying Location Objects in RADIUS
                  draft-ietf-geopriv-radius-lo-06.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on September 7, 2006.

Copyright Notice

   Copyright (C) The Internet Society (2006).

Abstract

   This document describes RADIUS attributes for conveying access
   network ownership and location information based on a civic and
   geospatial location format.




Tschofenig, et al.      Expires September 7, 2006               [Page 1]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   The distribution of location information is a privacy sensitive task.
   Dealing with mechanisms to preserve the user's privacy is important
   and addressed in this document.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  4
   2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  5
   3.  Delivery Methods for Location Information  . . . . . . . . . .  6
     3.1.  Authentication/Authorization Phase Delivery  . . . . . . .  6
     3.2.  Mid-session Authorization  . . . . . . . . . . . . . . . .  9
   4.  Scenarios  . . . . . . . . . . . . . . . . . . . . . . . . . . 11
     4.1.  Scenario 1 - Use of Location Information in AAA  . . . . . 11
     4.2.  Scenario 2 - Use of Location Information for Other
           Services . . . . . . . . . . . . . . . . . . . . . . . . . 12
   5.  Description of Attributes  . . . . . . . . . . . . . . . . . . 13
     5.1.  Operator-Name Attribute  . . . . . . . . . . . . . . . . . 13
     5.2.  Location-Information Attribute . . . . . . . . . . . . . . 14
       5.2.1.  Civic Location Information . . . . . . . . . . . . . . 14
       5.2.2.  Geospatial Location Information  . . . . . . . . . . . 16
   6.  Basic- and Extended-Policy-Rule Attributes . . . . . . . . . . 17
   7.  Requested-Info Attribute . . . . . . . . . . . . . . . . . . . 18
   8.  Diameter RADIUS Interoperability . . . . . . . . . . . . . . . 20
   9.  Attributes . . . . . . . . . . . . . . . . . . . . . . . . . . 21
     9.1.  Operator-Name Attribute  . . . . . . . . . . . . . . . . . 21
     9.2.  Location-Information Attribute . . . . . . . . . . . . . . 21
     9.3.  Basic Policy Rules Attribute . . . . . . . . . . . . . . . 26
     9.4.  Extended Policy Rules Attribute  . . . . . . . . . . . . . 27
     9.5.  Challenge-Capable Attribute  . . . . . . . . . . . . . . . 28
     9.6.  Requested-Info Attribute . . . . . . . . . . . . . . . . . 28
   10. Table of Attributes  . . . . . . . . . . . . . . . . . . . . . 32
   11. Matching with Geopriv Requirements . . . . . . . . . . . . . . 33
     11.1. Distribution of Location Information at the User's
           Home Network . . . . . . . . . . . . . . . . . . . . . . . 33
     11.2. Distribution of Location Information at the Visited
           Network  . . . . . . . . . . . . . . . . . . . . . . . . . 34
     11.3. Requirements matching  . . . . . . . . . . . . . . . . . . 35
   12. Example  . . . . . . . . . . . . . . . . . . . . . . . . . . . 41
   13. Privacy Considerations . . . . . . . . . . . . . . . . . . . . 43
     13.1. Entity in the visited network  . . . . . . . . . . . . . . 43
     13.2. Entity in the home network . . . . . . . . . . . . . . . . 44
   14. Security Considerations  . . . . . . . . . . . . . . . . . . . 47
   15. IANA Considerations  . . . . . . . . . . . . . . . . . . . . . 50
     15.1. New Registry: Operator Type  . . . . . . . . . . . . . . . 50
     15.2. New Registry: Requested-Info attribute . . . . . . . . . . 51
   16. Acknowledgments  . . . . . . . . . . . . . . . . . . . . . . . 52
   17. References . . . . . . . . . . . . . . . . . . . . . . . . . . 54



Tschofenig, et al.      Expires September 7, 2006               [Page 2]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


     17.1. Normative References . . . . . . . . . . . . . . . . . . . 54
     17.2. Informative References . . . . . . . . . . . . . . . . . . 54
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 57
   Intellectual Property and Copyright Statements . . . . . . . . . . 58















































Tschofenig, et al.      Expires September 7, 2006               [Page 3]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


1.  Introduction

   Wireless LAN (WLAN) access networks are being deployed in public
   places such as airports, hotels, shopping malls, and coffee shops by
   a diverse set of operators such as cellular network operators (GSM
   and CDMA), Wireless Internet Service Providers (WISPs), and fixed
   broadband operators.

   When a user executes the network access authentication procedure to
   such a network, information about the location and ownership of this
   network needs to be conveyed to the user's home network to which the
   user has a contractual relationship.  The main intent of this
   document is to enable location aware billing (e.g., determine the
   appropriate tariff and taxation in dependence of the location of the
   access network/user), location aware subscriber authentication and
   authorization for roaming environments and to enable other location
   aware services.

   This document describes AAA attributes that are used by a AAA client
   or a local AAA server in an access network for conveying location-
   related information to the user's home AAA server.  This document
   defines attributes for RADIUS [1].

   Although the proposed attributes in this draft are intended for
   wireless LAN deployments, they can also be used in other types of
   wireless and wired networks whenever location information is
   required.

   Location information needs to be protected against unauthorized
   access and distribution to preserve the user's privacy with regard to
   location information. [12] defines requirements for a protocol-
   independent model for the access to geographic location information.
   The model includes a Location Generator (LG) that creates location
   information, a Location Server (LS) that authorizes access to
   location information, a Location Recipient (LR) that requests and
   receives information, and a Rule Maker (RM) that provides
   authorization policies to the LS which enforces access control
   policies on requests to location information.













Tschofenig, et al.      Expires September 7, 2006               [Page 4]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


2.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [2].

   RADIUS specific terminology is borrowed from [1] and [3].

   Terminology related to privacy issues, location information and
   authorization policy rules is taken from [12].

   Based on today's protocols we assume that the location information is
   provided by the access network where the end host is attached.  As
   part of the network attachment authentication to the home network is
   provided.  The authenticated identity might refer to a user, a device
   or something else.  Although there might often be a user associated
   with the authentication process (either directly or indirectly;
   indirectly when a binding between a device and a user exists) there
   is no assurance that a particular real-world entity (such as a
   person) triggered this process.  Since location based authorization
   is executed based on the network access authentication of a
   particular "user" it might be reasonable to talk about user's privacy
   within this document even though scenarios exist where this might not
   apply (and device or network privacy might be the correct term).
   Furthermore, the authors believe that there is a relationship between
   the NAS (or other nodes in the access network) and the location of
   the entity that triggered the network access authentication, such as
   the user.  Knowing the location of a network (where the user or end
   host is attached to) might in many networks also reveal the location
   of the user or end host.  In some networks it is even possible to
   provide accurate location of the user or end host.  A similar
   assumption is also made with regard to the location information
   obtained via DHCP (see for example [4]).  This information might be
   used by applications in other protocols (such as SIP [13] with
   extensions [14]) to indicate the location of a particular user even
   though the location "only" refers to the location of the network or
   equipment within the network.  This assumption might not hold in all
   scenarios but seems to be reasonable and practicable.

   Please note that the authors use the terms end host and user
   interchangably with respect to the used identities as part of the
   network access authentication.  The term 'user' is used whenever the
   privacy of the user could potentially be compromised.








Tschofenig, et al.      Expires September 7, 2006               [Page 5]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


3.  Delivery Methods for Location Information

   Location Objects, which consist of location information and privacy
   rules, are transported over the RADIUS protocol from the visited
   access network to the home AAA server.  To embed a Location Object
   into RADIUS a number of attribute are used, such as Location-
   Information attribute, Basic-Policy-Rules attribute, Extended-Policy-
   Rules attribute, Operator-Name attribute.  These attributes can be
   delivered to the RADIUS server during the authentication/
   authorization phase described in Section 3.1, or in the mid-session
   using the dynamic authorization protocol framework described in
   Section 3.2.  This section describes messages flows for both delivery
   methods.

3.1.  Authentication/Authorization Phase Delivery

   Figure 1 shows an example message flow for delivering location
   information during the network access authentication/authorization
   procedure.  Upon a network authentication request from an access
   network client, the NAS submits a RADIUS Access-Request message which
   contains location information attributes among other required
   attributes.  The attributes (including location information) are
   added based on some criteria, such as local policy and business
   relationship with subscriber's home network provider.



























Tschofenig, et al.      Expires September 7, 2006               [Page 6]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


    +---------+             +---------+                   +---------+
    | Network |             | Network |                   |   AAA   |
    | Access  |             | Access  |                   |  Server |
    | Client  |             | Server  |                   |         |
    +---------+             +---------+                   +---------+
        |                       |                              |
        | Authentication phase  |                              |
        | begin                 |                              |
        |---------------------->|                              |
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Request               |
        |                       | + Location-Information       |
        |                       |----------------------------->|
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Accept                |
        |                       |<-----------------------------|
        | Authentication        |                              |
        | Success               |                              |
        |<----------------------|                              |
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Accounting-Request           |
        |                       | + Location-Information       |
        |                       |----------------------------->|
        |                       |                              |

   Figure 1: Location Delivery based on out-of-band Agreements

   If no location information is provided by the RADIUS client although
   it is required by the RADIUS server to compute an authorization
   decision then the RADIUS server challenges the RADIUS client.  This
   exchange is shown in Figure 2.  The Access-Challenge thereby provides
   a hint to Network Access Server regarding the type of location
   information attributes that are desired.  In the shown message flow
   these attributes are then provided in the subsequent Access-Request
   message.  When receiving this Access-Request message the
   authorization procedure at the RADIUS server might be based on a
   number of criteria, including the newly defined Location-Information
   and Operator-Name attributes.










Tschofenig, et al.      Expires September 7, 2006               [Page 7]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


    +---------+             +---------+                   +---------+
    | Network |             | Network |                   |   AAA   |
    | Access  |             | Access  |                   |  Server |
    | Client  |             | Server  |                   |         |
    +---------+             +---------+                   +---------+
        |                       |                              |
        | Authentication phase  |                              |
        | begin                 |                              |
        |---------------------->|                              |
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Request               |
        |                       | + Challenge-Capable          |
        |                       |----------------------------->|
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Challenge             |
        |                       |  + Rule set Information      |
        |                       |  + Requested-Info            |
        |                       |<-----------------------------|
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Request               |
        |                       | + Location-Information       |
        |                       |----------------------------->|
        |                       |                              |
        :                       :                              :
        :       Multiple Protocol Exchanges to perform         :
        :    Authentication, Key Exchange and Authorization    :
        :                  ...continued...                     :
        :                       :                              :
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Access-Accept                |
        |                       |  + Requested-Info            |
        |                       |<-----------------------------|
        | Authentication        |                              |
        | Success               |                              |
        |<----------------------|                              |
        |                       |                              |
        |                       | RADIUS                       |
        |                       | Accounting-Request           |
        |                       | + Location-Information       |
        |                       |----------------------------->|
        |                       |                              |

   Figure 2: Location Delivery based on dynamic Request




Tschofenig, et al.      Expires September 7, 2006               [Page 8]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   If the AAA server needs to obtain location information also in
   accounting messages then it needs to include a Requested-Info
   attribute to the Access-Accept to express that is desired.  The
   Network Access Server SHOULD then include location information to the
   RADIUS accounting messages.

3.2.  Mid-session Authorization

   The mid-session delivery method uses the Change of Authorization
   (COA) message as defined in [5].  At anytime during the session the
   RADIUS server MAY send a COA message containing session
   identification attributes to the access network.  The COA message MAY
   instruct the RADIUS client to generate an Authorize-Only Access-
   Request (Access-Request with Service-Type set to "Authorize-Only") in
   which case the RADIUS client MUST include location information in
   this Access-Request if it included location information is previous
   Access-Request messages.

   Figure 3 shows the approach graphically.


    +---------+                                    +---------+
    |   AAA   |                                    |   AAA   |
    |  Client |                                    |  Server |
    |  (NAS)  |                                    |         |
    +---------+                                    +---------+
        |                                               |
        |  COA  + Service-Type "Authorize Only"         |
        |<----------------------------------------------|
        |                                               |
        |  COA NAK + Service-Type "Authorize Only"      |
        |          + Error-Cause  "Request Initiated"   |
        |---------------------------------------------->|
        |                                               |
        | Access-Request + Service-Type "Authorize Only"|
        |             + Location-Information            |
        |             + Policy-Rules                    |
        |---------------------------------------------->|
        |                                               |
        | Access-Accept                                 |
        |<----------------------------------------------|
        |                                               |

   Figure 3: Mid-session Authorization

   Upon receiving the Access-Request message containing the Service-Type
   hint attribute with a value of Authorize-Only from the NAS, the
   RADIUS server MUST respond with either an Access-Accept or an Access-



Tschofenig, et al.      Expires September 7, 2006               [Page 9]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   Reject message.


















































Tschofenig, et al.      Expires September 7, 2006              [Page 10]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


4.  Scenarios

   In the following subsections we describe two scenarios for use of
   location information.  The location information may refer to the
   (visited) network or to the user.  How the network obtains the user's
   location information is out of the scope of this document.  There are
   two potential consumers of location information: the AAA server and
   location-based services.  The privacy implications of these scenarios
   are described in Section 13.

4.1.  Scenario 1 - Use of Location Information in AAA

   The home network operator requires location information for
   authorization and billing purposes.  The operator may deny service if
   location information is not available, or it may offer limited
   service.  The NAS delivers location information to the home AAA
   server.

   The location of the AAA client and/or the end host is transferred
   from the NAS to the RADIUS server (based on a pre-established
   agreement or if the RADIUS server asks for it).  The NAS and
   intermediaries (if any) are not allowed to use that information other
   than to forward it to the home network.

   The RADIUS server authenticates and authorizes the user requesting
   access to the network.  If the user's location policies are available
   to the RADIUS server, the RADIUS server MUST deliver those policies
   in an Access Accept to the RADIUS client.  This information MAY be
   needed if intermediaries or other elements want to act as Location
   Servers (see Section 4.2).  If the NAS or intermediaries do not
   receive policies from the RADIUS server (or the end host itself) then
   they MUST NOT make any use of the location information other than
   forwarding it to the user's home network.

   Location Information may also be reported in accounting messages.
   Accounting messages are generated when the session starts, stops and
   periodically.  Accounting messages may also be generated when the
   user roams during handoff.  This information may be needed by the
   billing system to calculate the user's bill.  For example, there may
   be different rates applied based on the location and there may be
   different tax rates applied based on the location.  Unless otherwise
   specified by authorization rules, location information in the
   accounting stream MUST NOT be transmitted to third parties.

   The location information in the accounting stream MUST only be sent
   in the proxy chain to the home network (unless specified otherwise).





Tschofenig, et al.      Expires September 7, 2006              [Page 11]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


4.2.  Scenario 2 - Use of Location Information for Other Services

   Location Servers are entities that receive the user's location
   information and transmit it to other entities.  In this second
   scenario, Location Servers comprise also the NAS and the RADIUS
   server.  The RADIUS servers are in the home network, in the visited
   network, or in broker networks.

   Unless explicitly authorized by the user's location policy, location
   information MUST NOT be transmitted to other parties outside the
   proxy chain between the NAS and the Home RADIUS server.

   Upon authentication and authorization, the home RADIUS server MUST
   transmit the ruleset (if available) in an Access-Accept.  The RADIUS
   client, intermediate proxies are allowed to share location
   information if they received ruleset indicates that it is allowed.



































Tschofenig, et al.      Expires September 7, 2006              [Page 12]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


5.  Description of Attributes

   Location information and ownership of the access network is conveyed
   in the following RADIUS attributes: Operator-Name and Location-
   Information.  Furthermore, the Basic-Policy-Rules and the Extended-
   Policy-Rules attributes are added to RADIUS message containing the
   Location-Information attribute turning location information into a
   Location Object as defined in [12].

5.1.  Operator-Name Attribute

   This attribute contains the operator namespace and the operator name.
   The operator name is combined with the Namespace to uniquely identify
   the owner of an access network.  The value of the Operator-Name is a
   non-NULL terminated string whose length MUST NOT exceed 253 bytes.
   The attribute value uniquely identifies the operator name within the
   scope of the operator namespace

   This Namespace field within the Operator-Name attribute provides
   information about the operator namespace.

   This document defines four values for this attribute: GSM, CDMA,
   REALM and ITU.

   Additional namespaces require IANA registration and MUST be
   associated with an organization responsible for assigning and
   managing the operator namespace.

   GSM (0):

      This namespace can be used to indicate operator names based on
      GSMA TADIG codes.  The TADIG Working Group within the GSM
      Association is the authority responsible for issuing unique
      Operator-Name values of this type.

   CDMA (1):

      The CDMA operator namespace can be used to indicate operator names
      based on the Home Network Identifier (HNI).  The HNI is the
      concatenation of the 3-digit Mobile Country Code (MCC) and 3-digit
      Mobile Network Code (MNC).  The IMSI Oversight Council (IOC) is
      the authority responsible for issuing unique Operator-Name values
      for operators of this type.

   REALM (2):

      The REALM operator namespace can be used to indicate operator
      names based on any registered domain name.  Such names are



Tschofenig, et al.      Expires September 7, 2006              [Page 13]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


      required to be unique and the rights to use a given realm name are
      obtained coincident with acquiring the rights to use a particular
      Fully Qualified Domain Name (FQDN).

   ITU (3):

      The ITU operator namespace can be used to indicate operator names
      based on ITU Carrier codes.  The Telecommunication Standardization
      Bureau (TSB) within the ITU-T is the authority responsible for the
      repository.  Each national regulatory authority is responsible for
      issuing unique Operator-Name values for operators of this type.

5.2.  Location-Information Attribute

   This document describes two formats for conveying location
   information: civic and geospatial location information.
   Section 5.2.1 defines the civic location information format.
   Section 5.2.2 defines the geospatial location information format.

   Additionally, the following fields provide more details about the
   transmitted location information.

   Entity: With the help of the 'Entity' field it is possible to
      differentiate whether the described Location Object refers to the
      user's client device (as estimated by the network) or to the
      location of the AAA client.

   Method: The 'Method' field describes the method for obtaining
      location information.  GPS or manual configuration are possible
      methods for obtaining location information.  The inclusion of this
      field should help the user's home network to deduce further
      information about the accuracy and to provide an easier
      translation into a Location Object for transmission to third party
      entities (e.g., using SIP).  Note that the values for this field
      are taken from [15].

5.2.1.  Civic Location Information

   Civic location is a popular way to describe the location of an
   entity.  An unstructured location format limits automatic processing
   capabilities by the RADIUS server.  For this document, we therefore
   reuse the civic location format defined in [4].

   The civic location format includes a number of fields, including the
   country (expressed as a two-letter ISO 3166 code) and the
   administrative units A1 through A6 of [4] .  This designation offers
   street-level precision.




Tschofenig, et al.      Expires September 7, 2006              [Page 14]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   For completeness we include more detailed information from [4] with
   regard to the defined civic location elements:

   +---------+-----------------------------------------+---------------+
   | Label   | Description                             | Example       |
   +---------+-----------------------------------------+---------------+
   | country | The country is identified by the        | US            |
   |         | two-letter ISO 3166 code.               |               |
   |         |                                         |               |
   | A1      | national subdivisions (state, region,   | New York      |
   |         | province, prefecture)                   |               |
   |         |                                         |               |
   | A2      | county, parish, gun (JP), district (IN) | King's County |
   |         |                                         |               |
   | A3      | city, township, shi (JP)                | New York      |
   |         |                                         |               |
   | A4      | city division, borough, city district,  | Manhattan     |
   |         | ward, cho (JP)                          |               |
   |         |                                         |               |
   | A5      | neighborhood, block, chome (JP)         | Morningside   |
   |         |                                         | Heights       |
   |         |                                         |               |
   | A6      | street, banchi and gou (JP)             | Broadway      |
   |         |                                         |               |
   | AC      | Additional code, JIS address code (JP)  | 13203000003   |
   |         |                                         |               |
   | PRD     | Leading street direction                | N, W          |
   |         |                                         |               |
   | POD     | Trailing street suffix                  | SW            |
   |         |                                         |               |
   | STS     | Street suffix                           | Avenue,       |
   |         |                                         | Street        |
   |         |                                         |               |
   | HNO     | House number, numeric part only.        | 123           |
   |         |                                         |               |
   | HNS     | House number suffix                     | A, 1/2        |
   |         |                                         |               |
   | LMK     | Landmark or vanity address              | Low Library   |
   |         |                                         |               |
   | LOC     | Additional location information         | Room 543      |
   |         |                                         |               |
   | FLR     | Floor                                   | 5             |
   |         |                                         |               |
   | NAM     | Name (residence, business or office     | Joe's         |
   |         | occupant)                               | Barbershop    |
   |         |                                         |               |
   | PC      | Postal code                             | 10027-0401    |
   +---------+-----------------------------------------+---------------+



Tschofenig, et al.      Expires September 7, 2006              [Page 15]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


                                  Table 1

   More description of these civic location elements can be found in
   Section 3.4 of [4].  These elements can be used to express further
   information about the location, language specific settings via the
   'language' item and encoding information via the 'script' item.
   Section 12 shows usage examples of this attribute.

   All attributes are optional and can appear in any order.  The values
   are encoded using UTF-8 [6].

   The usage of the type of place element (CAtype 29).  The values in
   this element defined for usage are definded with the location type
   registry [7].

   By using these location types it is possible to define more accurate
   location information.  The type of place element (CAtype 29) may
   appear more than once.  The content of this value will not be
   displayed to the user but rather used for authorization decisions.
   As such, internationalization support is not required.  If multiple
   type of place elements are used then no specific semantic is
   associated regarding the order.

   Example values for location types are 'aircraft', 'airport', 'cafe',
   'classroom', 'convention-center', 'restaurant', 'office' etc.

5.2.2.  Geospatial Location Information

   This document reuses geospatial location information from [8] which
   defines latitude, longitude, and altitude with resolution indicators
   for each.  The value in the Altitude field either indicates meters or
   floors (via the Altitude Type field).  As a coordinate reference
   system Section 2.1 of [8] defines (via extensible mechanism using
   IANA registration) three values in the 'Datum' field: WGS 84, NAD 83
   (with the associated vertical datum for the North American Vertical
   Datum of 1988), NAD 83 (with the associated vertical datum for the
   Mean Lower Low Water (MLLW).  WGS 84 is used by the GPS system.

   The NAS might return civic and geospatial location information.  Per
   default civic location SHOULD be added.











Tschofenig, et al.      Expires September 7, 2006              [Page 16]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


6.  Basic- and Extended-Policy-Rule Attributes

   In some environments it is possible for the user to attach
   information about its privacy preferences available to the network.
   These preferences allow the visited network, intermediate RADIUS
   proxies and the home network to authorize the distribution of the
   user's location information.  The home network will typically possess
   the user's authorization policies.

   Without the user providing authorization information two approaches
   are possible:

   o  The user hides its identity information from the access network
      and from intermediate networks using the appropriate network
      access authentication mechanism.  Section 13 discusses these
      issues in more details.

   o  The access network attaches default authorization policies which
      indicates that intermediate networks and the home network should
      not distribute the location information to other entities.  If the
      user is able to provide authorization policies to the NAS then
      these policies will be attached.  Additionally, the home network
      might have authorization policies which control distribution of
      location information.  These policies are sent from the RADIUS
      server to the RADIUS client.  Users can dynamically change their
      policies using the authroization framework defined in [16] and
      [17].

   With regard to authorization policies this document reuses work done
   in [15] and encodes it in an non-XML format.  Two fields ('sighting
   time' and 'time-to-live') are additionally included in the Location-
   Information attribute to conform to the Geopriv Requirements [12],
   Section 2.7.  Two RADIUS attributes are used for this purpose: Basic-
   Policy-Rule and Extended-Policy-Rule attribute.  The Basic-Policy-
   Rule attribute contains a fixed set of privacy relevant fields
   whereas the Extended-Policy-Rule attribute contains a reference to a
   more extensive authorization rule set.














Tschofenig, et al.      Expires September 7, 2006              [Page 17]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


7.  Requested-Info Attribute

   The Requested-Info attribute allows the RADIUS server to indicate
   whether it needs civic and/or geospatial location information of the
   NAS or the end host (i.e., the entities that are indicated in the
   Entity field of the Location-Information attribute).

   If the RADIUS server wants to dynamically decide on a per-request
   basis to ask for location information from the RADIUS client then the
   following cases need to be differentiated.  If the AAA client and the
   AAA server have agreed out-of-band to mandate the transfer of
   location information for every network access authentication request
   then the issues listed below are not applicable.

   o  The RADIUS server requires location information for computing the
      authorization decision.  If the RADIUS client does not provide
      location information with the Access-Request message then the
      Requested-Info attribute is attached to the Access-Challenge to
      indicate what is required.  Two cases can be differentiated:

      1.  If the RADIUS client sends the requested information then the
          RADIUS server can process the location-based attributes.

      2.  If the RADIUS server does not receive the requested
          information in response to the Access-Challenge (including the
          Requested-Info attribute) then the RADIUS server responds with
          an Access-Reject with an Error-Cause attribute (including the
          "Location-Info-Required" error value).  Note that an Access-
          Reject message SHOULD only be sent if the RADIUS server MUST
          use location information for returning a positive access
          control decision.

   o  If the RADIUS server would like location information in the
      Accounting-Request message but does not require it for computing
      an authorization decision then an Access-Accept MUST include a
      Required-Info attribute.  This is typically the case when location
      information is used for inclusion to the user's bill only.  The
      RADIUS client SHOULD attach location information to the
      Accounting-Request (unless authorization policies dictate
      something different), if it is available.

   If the RADIUS server does not send a Requested-Info attribute then
   the RADIUS client MUST NOT attach location information to messages to
   the RADIUS server The user's authorization policies MUST be consulted
   by the RADIUS server before requesting location information delivery
   from the RADIUS client.

   Figure 4 shows a simple protocol exchange where the RADIUS server



Tschofenig, et al.      Expires September 7, 2006              [Page 18]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   indicates the desire to obtain location information, namely civic
   location information of the user, to grant access.  Since the
   Requested-Info attribute is attached to the Access-Challenge the
   RADIUS server indicates that location information is required for
   computing an authorization decision.

    +---------+                    +---------+
    | RADIUS  |                    | RADIUS  |
    | Client  |                    | Server  |
    +---------+                    +---------+
         |                              |
         |                              |
         | RADIUS                       |
         | Access-Request               |
         | +Challenge-Capable           |
         |----------------------------->|
         |                              |
         | RADIUS                       |
         | Access-Challenge             |
         | + Requested-Info             |
         |   ('CIVIC_LOCATION',         |
         |    'USERS_LOCATION')         |
         |<-----------------------------|
         |                              |
         | RADIUS                       |
         | Access-Request               |
         | + Location-Information       |
         |   (civic-location)           |
         |----------------------------->|
         |                              |
         |        ....                  |

   Figure 4: RADIUS server requesting location information


















Tschofenig, et al.      Expires September 7, 2006              [Page 19]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


8.  Diameter RADIUS Interoperability

   In deployments where RADIUS clients communicate with Diameter servers
   or Diameter clients communicate with RADIUS servers then a
   translation agent will be deployed and operate.  The NASREQ
   specification [18] provides translation services.  Furthermore, the
   RADIUS attributes specified in this document are also applicable for
   deployments where Diameter clients talk with Diameter servers.
   Diameter AVP Code numbers for corresponding RADIUS attributes are
   allocated as specified in Diameter Base protocol specification
   Section 4.1 [9].








































Tschofenig, et al.      Expires September 7, 2006              [Page 20]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


9.  Attributes

   This section defines the Operator-Name, Location-Information, Basic
   Policy Rules, Extended Policy Rules, and the Capability attribute.

9.1.  Operator-Name Attribute

   The Operator-Name attribute SHOULD be sent in Access-Request, and
   Accounting-Request records where the Acc-Status-Type is set to Start,
   Interim, or Stop.

   A summary of the Operator-Name attribute is shown below.

       0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Type          | Length        |   Namespace   | Operator-Name ~
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Operator-Name                                                ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Type:
       To Be Assigned by IANA  - Operator-Name

     Length:
       >= 3 Bytes

     Namespace:
       The value within this field contains the
       Operator Namespace identifier.

       Example: 1 for CDMA

     Operator-Name:
       The text field of variable length contains an
       Access Network Operator Name.
       This field is a RADIUS base data type of Text.

       Example: anyisp.com

9.2.  Location-Information Attribute

   Location-Information attribute SHOULD be sent in Access-Request, and
   Accounting-Request records where the Acc-Status-Type is set to Start,
   Interim or Stop if available.

   The Location-Information Attribute has two variations depending on
   civic or geospatial location information.  The format is shown below.



Tschofenig, et al.      Expires September 7, 2006              [Page 21]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


       0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   Type        |  Length       | Code          |  Entity       |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Sighting Time                                                 ~
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Sighting Time                                                 |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Time-to-Live                                                  ~
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Time-to-Live                                                  |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   Method      |    Location-Info                             ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+




































Tschofenig, et al.      Expires September 7, 2006              [Page 22]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


     Type (8 bits):
       To Be Assigned by IANA  - Location-Information

     Length (8 bits):
       >= 21 Bytes

     Code (8 bits):
       Describes the location format that is carried in this attribute:
       (0) describes civic location information
       (1) describes geospatial location information

     Entity (8 bits):
       Describes which location this attribute refers to:
       (0) describes the location of the user's client device
       (1) describes the location of the AAA client

     Sighting Time (64 bits):
       NTP timestamp for the 'sighting time' field.

     Time-to-Live (64 bits):
       NTP timestamp for the 'time-to-live' field.

     Method (8 bits):
       Describes the way that the location information was
       derived or discovered. The following values are defined:
       (0) Global Positioning System (GPS)
       (1) GPS with assistance (A-GPS)
       (2) Manual configured information
       (3) Provided by DHCP
       (4) Triangulation: triangulated from time-of-arrival,
           signal strength or similar measurements
       (5) Cell: location of the cellular radio antenna
       (6) IEEE 802.11 WLAN access point

     Location-Info (variable):
       Contains either civic or
       geospatial location information attributes.

   The following two fields need some explanation:

   sighting time: This field indicates when the Location Information was
      accurate.  The data type of this field is a string and the format
      is a 64 bit NTP timestamp [19].

   time-to-live: This field gives a hint until when location information
      should be considered current.  Note that the time-to-live field is
      different than retention-expires, which indicates the time the
      recipient is no longer permitted to possess the location



Tschofenig, et al.      Expires September 7, 2006              [Page 23]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


      information and its encapsulating Location Object.  The data type
      of this field is a string and the format is a 64 bit NTP timestamp
      [19].

   For civic location information the Location-Info field in the above
   structure is defined as followed:


       0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |          Countrycode          |  Civic address elements      ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Countrycode (16 bits):
       Two-letter ISO 3166 country code in capital ASCII letters.

     Civic address elements (variable):
       The text field contains location information element.

   The format of the civic address elements is described in Section 3.3
   of [4] with a TLV pair (whereby the Type and Length fields are one
   octet long).  An example is given in Section 12.

   For geospatial location information the Location-Info field is
   defined as follows:

























Tschofenig, et al.      Expires September 7, 2006              [Page 24]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


        0                   1                   2                   3
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |   LaRes   |     Latitude                                      +
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Latitude      |    LoRes  |  Longitude                        +
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |     Longitude                 |  AT   |  AltRes   | Altitude  +
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     |                   Altitude                    |    Datum      |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     LaRes (6 bits):
       Latitude resolution

     Latitude (34 bits)

     LoRes (6 bits):
       Longitude resolution.

     Longitude (34 bits)

     Altitude (30 bits)

     AltRes (6 bits):
       Altitude resolution

     AT (4 bits):
       Altitude Type for altitude. The following codes are defined:

       (1) Meters
       (2) Floors

    Datum (8 bits):
      Coordinate reference system
      The following codes for the this field are defined:

      (1) WGS 84
      (2) NAD 83 (with the associated vertical datum for
                  the North American Vertical Datum of 1988)
      (3) NAD 83 (with the associated vertical datum for
                  the Mean Lower Low Water (MLLW))

   The length of the Location-Information Attribute MUST NOT exceed 253
   octets.  The length of the geospatial location information format is
   fixed with 16 bytes plus a four byte header.

   The 'Datum' field contains an identifier for the coordinate system



Tschofenig, et al.      Expires September 7, 2006              [Page 25]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   used to interpret the values of Latitude, Longitude and Altitude.
   The field with value (2) and the value (3) both represent the NAD 83
   coordinate reference system but they differ from each other with
   regard to their vertical datum representation as briefly noted in
   Section 5.2.2 and described in more detail in [8].

9.3.  Basic Policy Rules Attribute

   The Basic-Policy-Rules attribute MUST be sent in Access-Accept,
   Access-Challenge, Access-Request, Access-Reject and Accounting-
   Request messages if location information is transmitted with this
   exchange.  If authorization policy rules are available to the RADIUS
   client then the Access-Request MUST carry the Basic-Policy-Rules
   attribute to to the RADIUS server.

   A summary of the Basic-Policy-Rules attribute is shown below.

       0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Type          | Length        |R|  Flags                      |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Retention Expires                                            ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Retention Expires                                             |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Note Well                                                    ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Type :
       To Be Assigned by IANA  - Basic-Policy-Rules

     Length:
       >= 12 Bytes

     Flag (16 bits):
       Only the first bit (R) is defined an corresponds to the
       retransmission-allowed field. All other bits are reserved.

     Retention Expires (64 bits):
       NTP timestamp for the 'retention-expires' field.

     Note Well (variable):
       This field contains a URI which points to
       human readable privacy instructions.

   This document reuses fields of the 'usage-rules' element, described
   in [15].  These fields have the following meaning:



Tschofenig, et al.      Expires September 7, 2006              [Page 26]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   retransmission-allowed: When the value of this element is '0', then
      the recipient of this Location Object is not permitted to share
      the enclosed location information, or the object as a whole, with
      other parties.  The value of '1' allows to share the location
      information with other parties by considering the extended policy
      rules.

   retention-expires: This field specifies an absolute date at which
      time the Recipient is no longer permitted to possess the location
      information.  The data type of this field is a string and the
      format is a 64 bit NTP timestamp [19].

   note-well: This field contains a URI which points to human readable
      privacy instructions.  This field is useful when location
      information is distributed to third party entities, which can
      include humans in a location based service.  RADIUS entities are
      not supposed to process this field.

      Whenever a Location Object leaves the AAA system the URI in the
      note-well attribute MUST be expanded to the human readable text.
      For example, when the Location Object is transferred to a SIP
      based environment then the human readable text is placed in the
      text is put into the 'note-well' attribute inside the 'usage-
      rules' element inside the PIDF-LO document (see [15]).

9.4.  Extended Policy Rules Attribute

   The Extended-Policy-Rules attribute SHOULD be sent in Access-Accept,
   Access-Challenge, Access-and Access-Reject messages if location
   information is transmitted with this exchange.  If authorization
   policy rules are available to the RADIUS client then the Access-
   Request MUST carry the Basic-Policy-Rules attribute to to the RADIUS
   server.

   Ruleset reference field of this attribute is of variable length.  It
   contains a URI that indicates where a richer ruleset is available.
   The full ruleset SHOULD be fetched using Transport Layer Security
   (TLS).  As a deviation from [15] this field only contains a reference
   and does not carry an attached rule set.  This modification is
   motivated by the size limitations imposed by RADIUS.

   A summary of the Extended-Policy-Rules attribute is shown below.









Tschofenig, et al.      Expires September 7, 2006              [Page 27]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


       0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Type          | Length        | Ruleset reference            ...
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Type :
       To Be Assigned by IANA  - Extended-Policy-Rules

     Length:
       > 3 Bytes

     Ruleset reference:
       The text field contains a URI which points to policy rules.

9.5.  Challenge-Capable Attribute

   The Challenge-Capable attribute allows a NAS (or client function of a
   proxy server) to indicate support for processing general purpose
   Access-Challenge messages from the RADIUS server, beyond those
   specified for support of the authentication methods of textual
   challenge-response, CHAP or EAP.  This mechanism allows the RADIUS
   server to request additional information from the RADIUS client prior
   to making an authentication and authorization decision.  The
   Challenge-Capable attribute MUST appear in Access-Request Messages,
   if the NAS supports this feature, as a hint to the RADIUS Server.


       0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Type          | Length        | Value                         |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Type (8 bits):
       To Be Assigned by IANA - Challenge-Capable Attribute

     Length (8 bits):
       = 4 Bytes

     Value (16 bits):
       The content of this field MUST be set to 0.

9.6.  Requested-Info Attribute

   The Requested-Info attribute MUST be sent by the RADIUS server if it
   wants the RADIUS client to return civic and/or geospatial
   information.  This Requested-Info attribute MAY appear in the Access-



Tschofenig, et al.      Expires September 7, 2006              [Page 28]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   Accept or in the Access-Challenge messages.

   A summary of the attribute is shown below.

     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Type          | Length        | Requested-Info                |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
     | Requested-Info                |
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

        Type:
          To Be Assigned by IANA - Requested-Info Attribute

        Length:
          6 Bytes

        Requested-Info (32 bits):
          This text field contains a numerical value that encodes the
          requested information attributes.
          Each value represents a bit position.

   Currently the following capabilities are specified:

   Name:

      CIVIC_LOCATION


   Description:

      The RADIUS server uses this attribute to request information from
      the RADIUS client to be returned.  The numerical value
      representing CIVIC_LOCATION requires the RADIUS client to attach
      civic location attributes.


   Numerical Value:

      A numerical value of this attribute is '1'.


   Name:

      GEO_LOCATION





Tschofenig, et al.      Expires September 7, 2006              [Page 29]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   Description:

      The RADIUS server uses this attribute to request information from
      the RADIUS client to be returned.  The numerical value
      representing GEO_LOCATION requires the RADIUS client to attach
      geospatial location attributes.


   Numerical Value:

      A numerical value of this attribute is '2'.


   Name:

      USERS_LOCATION


   Description:

      The numberical value representing USERS_LOCATION indicates that
      the AAA client must sent a Location-Information attribute that
      contains location information with the Entity attribute expressing
      the value of zero (0).  A value of zero indicates that the
      location information in the Location-Information attribute refers
      to the user's client device.


   Numerical Value:

      A numerical value of this attribute is '4'.


   Name:

      NAS_LOCATION


   Description:

      The numberical value representing NAS_LOCATION indicates that the
      AAA client must sent a Location-Information attribute that
      contains location information with the Entity attribute expressing
      the value of one (1).  A value of one indicates that the location
      information in the Location-Information attribute refers to the
      AAA client.





Tschofenig, et al.      Expires September 7, 2006              [Page 30]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   Numerical Value:

      A numerical value of this attribute is '8'.


   If neither the NAS_LOCATION nor the USERS_LOCATION bit is set then
   per-default the location of the user's client device MUST be
   returned.  If both the NAS_LOCATION and the USERS_LOCATION bits are
   set then the location information has to be put into separate AVPs.
   If neither the CIVIC_LOCATION nor the GEO_LOCATION bit is set then
   per-default civic location information MUST be returned.  If both the
   CIVIC_LOCATION and the GEO_LOCATION bits are set then the location
   information has to be put into separate AVPs.  The value of
   NAS_LOCATION and USERS_LOCATION refers to the location requested via
   CIVIC_LOCATION and/or via GEO_LOCATION.  As an example, if the bits
   for NAS_LOCATION, USERS_LOCATION and GEO_LOCATION are set then
   location information of the AAA client and the users' client device
   are returned in a geospatial location format.

































Tschofenig, et al.      Expires September 7, 2006              [Page 31]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


10.  Table of Attributes

   The following table provides a guide which attributes may be found in
   which RADIUS messages, and in what quantity.

   Request Accept Reject Challenge Accounting  #  Attribute
                                   Request
   0-1     0      0      0         0-1        TBD  Operator-Name
   0+      0      0      0         0+         TBD  Location-Information
   0-1     0-1    0-1    0-1       0-1        TBD  Basic-Policy-Rules
   0-1     0-1    0-1    0-1       0-1        TBD  Extended-Policy-Rules
   0       0-1    0      0-1       0-1        TBD  Requested-Info
   0-1     0      0      0         0          TBD  Challenge-Capable

   The Location-Information attribute may appear more than once.  This
   is useful if the size of one Location-Information attribute exceeds
   the maximum size of an attribute.  This might happen in case of civic
   location information that has a variable number of fields.  The
   individual fields used for representing civic location information
   inside the Location-Information attribute (see Section 5.2.1) MUST
   NOT appear more than once.  For example, it is not allowed to have a
   CAtype of 3 (indicating the name of the city) to appear more than
   once.

   The next table shows the occurrence of the error-cause attribute.

   Request Accept Reject Challenge Accounting #  Attribute
                                   Request
   0       0       0-1     0        0        TBD Location-Info-Required
   0       0       0-1     0        0        101 Error-Cause





















Tschofenig, et al.      Expires September 7, 2006              [Page 32]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


11.  Matching with Geopriv Requirements

   This section compares the Geopriv requirements described in [12] and
   the approach of distributing Location Objects with RADIUS.

   The main usage scenario aimed for Location Object transport in RADIUS
   assumes that the Location Server and the Location Recipient are co-
   located at a single entity with regard to location based network
   access authorization, taxation and billing.  In Section 11.1 and
   Section 11.2 we discuss privacy implications when RADIUS is not used
   according to these usage scenario.

   In Section 11.3 Geopriv requirements are matched against these two
   scenarios.

11.1.  Distribution of Location Information at the User's Home Network

   This section focuses on location information transport from the local
   AAA server (acting as the Location Generator) to the home AAA server
   (acting as the Location Server).  To use a more generic scenario we
   assume that the visited AAA and the home AAA server belong to
   different administrative domains.  The Location Recipient obtains
   location information about a particular Target via protocols
   specified outside the scope this document (e.g., SIP, HTTP or an
   API).

   Please note that the main usage scenario defined in this document
   assumes that the Location Server and the Location Recipient are co-
   located into a single entity with regard to location based network
   access authorization, taxation and billing.

   The subsequent figure shows the interacting entities graphically.



















Tschofenig, et al.      Expires September 7, 2006              [Page 33]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


    visited network    |        home network
                       |
                       |        +----------+
                       |        |  Rule    |
                       |        | Holder   |
                       |        |          |
                       |        +----+-----+
                       |             |
                       |         rule|interface
                       |             V
     +----------+      |        +----------+               +----------+
     |Location  |  publication  | Location |  notification |Location  |
     |Generator |<------------->| Server   |<------------->|Recipient |
     |          |  interface    |          |  interface    |          |
     +----------+      |        +----------+               +----------+
                       |
     Local AAA      RADIUS       Home AAA     SIP/HTTP/API/etc.
     Server            |         Server
                       |

   Figure 16: Location Server at the Home Network

   The term 'Rule Holder' in Figure 16 denotes the entity which creates
   the authorization ruleset.

11.2.  Distribution of Location Information at the Visited Network

   This section describes a scenario where Location Information is
   distributed by the visited network.

   In order for this scenario to be applicable the following two
   assumptions must hold:

   o  The visited network deploys a Location Server and wants to
      distribute Location Objects of a user

   o  The visited network is able to learn the user's identity

   The visited network provides location information to a Location
   Recipient (e.g., via SIP or HTTP).  During the network access
   authentication procedure the visited network is able to retrieve the
   user's authorization policies from the home AAA server.  This should
   ensure that the visited network acts according to the user's
   policies.

   The subsequent figure shows the interacting entities graphically.
   The transport of the Location Object is not shown in this figure
   since this aspect is already covered in the previous paragraph.



Tschofenig, et al.      Expires September 7, 2006              [Page 34]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


    visited network    |        home network
                       |
     +----------+      |
     |Location  |      |
     |Recipient |      |
     |          |      |
     +----------+      |
          ^            |        +----------+
          |            |        |  Rule    |
          |            |        | Holder   |
      notification     |        |          |
       interface       |        +----+-----+
          |            |             |
          |            |         rule|interface
          v            |             V
     +----------+      |        +----------+
     |Location  | Rule Transport| Home AAA |
     |Generator |<------------->| Server   |
     |& Server  |   RADIUS      |          |
     +----------+      |        +----------+
                       |

   Figure 17: Location Server at the Visited Network

11.3.  Requirements matching

   Section 7.1 of [12] details the requirements of a "Location Object".

   There are:


   Req. 1.  (Location Object generalities):

      *  Regarding requirement 1.1, the Location Object has to be
         understood by the RADIUS server (and possibly a Diameter server
         in case of interworking between the two) as defined in this
         document.  Due to the encoding of the Location Object it is
         possible to convert it to the format used in GMLv3 [20].  The
         same civic location information format is used in PIDF-LO [15]
         and this document.

      *  Regarding requirement 1.2, some fields of the Location Object
         defined in this document are optional.  See Section 5.2.1 as an
         example.

      *  Regarding requirement 1.3, the inclusion of type of place item
         (CAtype 29) gives a further classification of the location.
         This attribute can be seen as an extension.



Tschofenig, et al.      Expires September 7, 2006              [Page 35]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


      *  Regarding requirement 1.4, the Location Object is extensible in
         the same fashion as RADIUS is extensible.

      *  Regarding requirement 1.5, the Location Object is useful for
         both receiving and sending location information as described in
         this document.

      *  Regarding requirement 1.6, the Location Object contains both
         location information and privacy rules.  Location information
         is described in Section 5.2 and the corresponding privacy rules
         are detailed in Section 9.3 and in Section 9.4.

      *  Regarding requirement 1.7, the Location Object is usable in a
         variety of protocols.  The format of the object is reused from
         other documents as detailed in the respective sections (see
         Section 5.2, Section 9.3 and in Section 9.4).

      *  Regarding requirement 1.8, the encoding of the Location Object
         has an emphasis on a lightweight encoding format.  As such it
         is useable on constrained devices.


   Req. 2.  (Location Object fields):

      *  Regarding requirement 2.1, the Target Identifier is carried
         within the network access authentication protocol (e.g., within
         the EAP-Identity Response when EAP is used and/or within the
         EAP method itself).  As described in Section 13 it has a number
         of advantages if this identifier is not carried in clear text.
         This is possible with certain EAP methods whereby the identity
         in the EAP-Identity Response only contains information relevant
         for routing the response to the user's home network.  The user
         identity is protected by the authentication and key exchange
         protocol.

      *  Regarding requirement 2.2, the Location Recipient is in the
         main scenario the home AAA server.  For a scenario where the
         Location Recipient is obtaining Location Information from the
         Location Server via HTTP or SIP the respective mechanisms
         defined in these protocols are used to identify the recipient.
         The Location Generator cannot, a priori, know the recipients if
         they are not defined in this protocol.

      *  Regarding requirement 2.3, the credentials of the Location
         Recipient are known to the RADIUS entities based on the
         security mechanisms defined in the RADIUS protocol itself.
         Section 14 describes these security mechanisms offered by the
         RADIUS protocol.  The same is true for requirement 2.4.



Tschofenig, et al.      Expires September 7, 2006              [Page 36]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


      *  Regarding requirement 2.5, Section 5.2 describes the content of
         the Location Field.  Motion and direction vectors as listed in
         requirement 2.6 are not provided as attributes.  It is,
         however, possible to deduce the motion and direction of an
         entity via the Mid-session Delivery mechanism as shown in
         Figure 3.

      *  Regarding requirement 2.6, this document only describes one
         Location Data Type for civic and for geospatial location
         information, respectively.  No negotiation needs to take place.

      *  Regarding requirement 2.7, timing information is provided with
         'sighting time' and 'time-to-live' field defined in
         Section 9.3.

      *  Regarding requirement 2.8, a reference to an external (more
         detailed ruleset) is provided with the Section 9.4 attribute.

      *  Regarding requirement 2.9, security headers and trailers are
         provided as part of the RADIUS protocol or even as part of
         IPsec.

      *  Regarding requirement 2.10, a version number in RADIUS is
         provided with the IANA registration of the attributes.  New
         attributes are assigned a new IANA number.


   Req. 3.  (Location Data Types):

      *  Regarding requirement 3.1, this document defines two Location
         Data Types as described in Section 5.2.

      *  With the support of civic and geospatial location information
         support requirement 3.2 is fulfilled.

      *  Regarding requirement 3.3, the geospatial location information
         as defined in this document only refers to absolute
         coordinates.  However, the granularity of the location
         information can be reduced with the help of the AltRes, LoRes,
         LaRes fields described in the Location-Information attribute
         (see Section 9.2).

      *  Regarding requirement 3.4, further Location Data Types can be
         added via new coordinate reference systems (CRSs) (see Datum
         field in the Location-Information attribute of Section 5.2),
         extensions to existing fields or via additional attributes.

   Section 7.2 of [12] details the requirements of a "Using Protocol".



Tschofenig, et al.      Expires September 7, 2006              [Page 37]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   These requirements are listed below:


   Req. 4.: The using protocol has to obey the privacy and security
      instructions coded in the Location Object and in the corresponding
      Rules regarding the transmission and storage of the LO.  This
      document requires, that RADIUS entities sending or receiving
      location MUST obey such instructions.


   Req. 5.: The using protocol will typically facilitate that the keys
      associated with the credentials are transported to the respective
      parties, that is, key establishment is the responsibility of the
      using protocol.  Section 14 specifies how security mechanisms are
      used in RADIUS and how they can be reused to provide security
      protection for the Location Object.  Additionally, the privacy
      considerations (see Section 13) are also relevant for this
      requirement.


   Req. 6.  (Single Message Transfer): In particular, for tracking of
      small target devices, the design should allow a single message/
      packet transmission of location as a complete transaction.  The
      encoding of the Location Object is specifically tailored towards
      the inclusion into a single message that even respects the (Path)
      MTU size.  The concept of a transaction is not immediately
      applicable to RADIUS.

   Section 7.3 of [12] details the requirements of a "Rule based
   Location Data Transfer".  These requirements are listed below:


   Req. 7.  (LS Rules): With the scenario shown in Figure 16 the
      decision of a Location Server to provide a Location Recipient
      access to location information is based on Rule Maker-defined
      Privacy Rules which are stored at the home network or are
      accessible for the home network.  With regard to the scenario
      shown in Figure 17 the Rule Maker-defined Privacy Rules are sent
      from the home network to the visited network as part of the
      Policy-Information attribute (see Section 9.3, Section 9.4 and
      Section 13 for more details).


   Req. 8.  (LG Rules): For mid-session delivery it is possible to
      enforce the user's privacy rules for the transfer of the Location
      Object.  For the initial transmission of a Location Object the
      user would have to use network access authentication methods which
      provide user identity confidentiality which would render the



Tschofenig, et al.      Expires September 7, 2006              [Page 38]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


      Location Object completely useless for the visited network.  For
      the scenario shown in Figure 16 the visited network is already in
      possession of the users location information prior to the
      authentication and authorization of the user.  A correlation
      between the location and the user identity might, however, still
      not be possible for the visited network (as explained in
      Section 13).  The visited network MUST evaluate ruleset provided
      by the home AAA server as soon as possible.


   Req. 9.  (Viewer Rules): The Rule Maker might define (via mechanisms
      outside the scope of this document) which policy rules are
      disclosed to other entities.


   Req. 10.  (Full Rule language): Geopriv has defined a rule language
      capable of expressing a wide range of privacy rules which is
      applicable in the area of the distribution of Location Objects.  A
      basic ruleset is provided with the Basic-Policy-Rules attribute
      Section 9.3.  A reference to the extended ruleset is carried in
      Section 9.4.  The format of these rules are described in [16] and
      [17].


   Req. 11.  (Limited Rule language): A limited (or basic) ruleset is
      provided by the Policy-Information attribute Section 9.3 (and as
      introduced with PIDF-LO [15]).

   Section 7.4 of [12] details the requirements of a "Location Object
   Privacy and Security".  These requirements are listed below:


   Req. 12 (Identity Protection): Support for unlinkable pseudonyms is
      provided by the usage of a corresponding authentication and key
      exchange protocol.  Such protocols are available, for example,
      with the support of EAP as network access authentication methods.
      Some EAP methods support passive user identity confidentiality
      whereas others even support active user identity confidentiality.
      This issue is further discussed in Section 14.  The importance for
      user identity confidentiality and identity protection has already
      been recognized (see for example a document on 'EAP Method
      Requirements for Wireless LANs' [21]).


   Req. 13.  (Credential Requirements): As described in Section 14
      RADIUS signaling messages can be protected with IPsec.  This
      allows a number of authentication and key exchange protocols to be
      used as part of IKE, IKEv2 or KINK.



Tschofenig, et al.      Expires September 7, 2006              [Page 39]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   Req. 14.  (Security Features): Geopriv defines a few security
      requirements for the protection of Location Objects such as mutual
      end-point authentication, data object integrity, data object
      confidentiality and replay protection.  As described in Section 14
      these requirements are fulfilled with the usage of IPsec if the
      mutual authentication refers to the RADIUS entities (acting as
      various Geopriv entities) which directly communicate with each
      other.


   Req. 15.  (Minimal Crypto): A minimum of security mechanisms are
      mandated by the usage of RADIUS.  Communication security for
      Location Objects between AAA infrastructure elements is provided
      by the RADIUS protocol (including IPsec and its dynamic key
      management framework) rather than on relying on object security
      via S/SIME (which is not available with RADIUS).



































Tschofenig, et al.      Expires September 7, 2006              [Page 40]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


12.  Example

   This section provides an example for a civic location information
   format within the Location-Information attribute.  The size of the
   geo-spatial location information object is fixed and well-described
   examples can be found in the Appendix of [8].

   Due to the size limitations of the RADIUS attributes we give a more
   detailed example borrowed from Section 4 of [4].


                +-------------+-----------+-------------------+
                | Type        | Length    | Value             |
                +-------------+-----------+-------------------+
                | Type        | 8 bits    | TBD               |
                | Length      | 8 bits    | --total length--  |
                | Code        | 16 bits   | 1                 |
                | Precision   | 8 bits    | 2                 |
                | Countrycode | 16 bits   | DE                |
                | CAtype      | 8 bits    | 1                 |
                | CAlength    | 8 bits    | 7                 |
                | CAvalue     | 7 bytes   | Bavaria           |
                | CAtype      | 8 bits    | 3                 |
                | CAlength    | 8 bits    | 6                 |
                | CAvalue     | 6 byte    | Munich            |
                | CAtype      | 8 bits    | 6                 |
                | CAlength    | 8 bits    | 11                |
                | CAvalue     | 11 bytes  | Marienplatz       |
                | CAtype      | 8 bits    | 19                |
                | CAlength    | 8 bits    | 1                 |
                | CAvalue     | 1 byte    | 8                 |
                | CAtype      | 8 bits    | 24                |
                | CAlength    | 8 bits    | 5                 |
                | CAvalue     | 5 bytes   | 80331             |
                +-------------+-----------+-------------------+

   The Length element provides the length of the entire payload minus
   the length of the initial 'Type', the 'Length' and the 'Code'
   attribute.  The 'Entity' field has a value of '2' which refers to the
   location of the user's client.  The 'CountryCode' field is set to
   'DE'.  Note that the subsequent attributes are in Type-Length-Value
   format.  Type '1' indicates the region of 'Bavaria', '3' refers to
   the city 'Munich', '6' to the street 'Marienplatz', the house number
   '8' is indicated by the type '19' and the zip code of '80331' is of
   type '24'.

   The length of the elements need to consider the fact that all CAvalue
   elements are UTF-8 encoded.



Tschofenig, et al.      Expires September 7, 2006              [Page 41]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   The following example illustrates a civic address in Japan.

                +-------------+-----------+-------------------+
                | Type        | Length    | Value             |
                +-------------+-----------+-------------------+
                | Type        | 8 bits    | TBD               |
                | Length      | 8 bits    | --total length--  |
                | Code        | 16 bits   | 1                 |
                | Precision   | 8 bits    | 2                 |
                | Countrycode | 16 bits   | JP                |
                | CAtype      | 8 bits    | 1                 |
                | CAlength    | 8 bits    | 5                 |
                | CAvalue     | 7 bytes   | Tokyo             |
                | CAtype      | 8 bits    | 3                 |
                | CAlength    | 8 bits    | 13                |
                | CAvalue     | 6 byte    | Musashino-shi     |
                | CAtype      | 8 bits    | 5                 |
                | CAlength    | 8 bits    | 7                 |
                | CAvalue     | 11 bytes  | 3-chome           |
                | CAtype      | 8 bits    | 30                |
                | CAlength    | 8 bits    | 8                 |
                | CAvalue     | 1 byte    | 180-8585          |
                | CAtype      | 8 bits    | 32                |
                | CAlength    | 8 bits    | 11                |
                | CAvalue     | 5 bytes   | 13203000003       |
                +-------------+-----------+-------------------+

   Please note that the CAtype 32 ("additional code" item) provides an
   additional, country-specific code identifying the location, such as
   the Japan Industry Standard (JIS) address code.





















Tschofenig, et al.      Expires September 7, 2006              [Page 42]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


13.  Privacy Considerations

   This section discusses privacy implications for the distribution of
   location information within RADIUS.

   In many cases the location information of the network also reveals
   the current location of the user with a certain degree of precision
   depending on the mechanism used, the positioning system, update
   frequency, where the location was generated, size of the network and
   other mechanisms (such as movement traces or interpolation).

   Two entities might act as Location Servers as shown in Section 4, in
   Figure 16 and in Figure 17:

13.1.  Entity in the visited network

   In this scenario it is difficult to obtain authorization policies
   from the end host (or user) immediately when the user attaches to the
   network.  In this case we have to assume that the visited network
   does not allow unrestricted distribution of location information to
   other than the intended recipients (e.g., to third party entities).

   The visited network MUST behave according to the following
   guidelines:

   o  Per default only the home network is allowed to receive location
      information.  The visited network MUST NOT distribute location
      information to third parties without seeing the user's privacy
      rule set.

   o  If the home network provides the Basic-Policy-Rules attribute
      either as part of the Access-Accept, the Access-Reject or the
      Access-Challenge message then the visited network MUST follow the
      guidance given with these rules.

   o  If the home network provides the Extended-Policy-Rules attributes
      either as part of the Access-Accept, the Access-Reject or the
      Access-Challenge message then the visited network MUST fetch the
      full ruleset at the indicated URL and MUST follow the guidance
      given with these rules.

   o  If the RADIUS client in the visited network learns the basic rule
      set or a reference to the extended rule set by means outside the
      RADIUS protocol (e.g., provided by the end host) then it MUST
      include the Basic-Policy-Rules and the Extended-Policy-Rules
      attribute in the Access-Request message towards the home AAA
      server.  Furthermore, the visited network MUST evaluate these
      rules prior to the transmission of location information either to



Tschofenig, et al.      Expires September 7, 2006              [Page 43]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


      the home network or a third party.  The visited network MUST
      follow the guidance given with these rules.

   o  If the RADIUS client in the visited network receives the Basic-
      Policy-Rules attribute with Access-Accept or the Access-Challenge
      message then the Basic-Policy-Rules MUST be attach in subsequent
      RADIUS messages which contain the Location-Information attribute
      (such as interim accounting messages).

   o  If the RADIUS client in the visited network receives the Extended-
      Policy-Rules attribute with Access-Accept or the Access-Challenge
      message then the Basic-Policy-Rules attribute MUST be attach in
      subsequent RADIUS messages which contain the Location-Information
      attribute (such as interim accounting messages).

13.2.  Entity in the home network

   The AAA server in the home network might be an ideal place for
   storing authorization policies.  The user typically has a contractual
   relationship with his home network and hence the trust relationship
   between them is stronger.  Once the infrastructure is deployed and
   useful applications are available there might be a strong desire to
   use location information for other purposes as well (such as location
   aware applications).  Authorization policy rules described in [17]
   and in [16] are tailored for this environment.  These policies might
   be useful for limiting further distribution of the user's location to
   other location based services.  The home AAA server (or a similar
   entity) thereby acts as a location server for access to location
   services.

   The home network MUST behave according to the following guidelines:

   o  As a default policy the home network MUST NOT distribute the
      user's location information to third party entities.

   o  If a user provides basic authorization policies then these rules
      MUST be returned to the visited network in the Access-Accept, the
      Access-Reject or the Access-Challenge message.

   o  If a user provides basic authorization policies then these rules
      MUST be returned to the visited network in the Access-Accept, the
      Access-Reject or the Access-Challenge message.

   o  If a user provides extended authorization policies then they MUST
      be accessible for the visited networking using a reference to
      these rule set.  The Extended-Policy-Rules attribute MUST include
      the reference and they MUST be sent to the visited network in the
      Access-Accept, the Access-Reject or the Access-Challenge message.



Tschofenig, et al.      Expires September 7, 2006              [Page 44]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   o  The home network MUST follow the user provided rule set for both
      local storage and for further distribution.  With regard to the
      usage of these rules the home network MUST ensure that the users
      preferences are taken care of within the given boundaries (such as
      legal regulations or operational considerations).  For example, a
      user might not want the home network to store information about
      its location information beyond a indicated time frame.  However,
      a user might on the other hand want to ensure that disputes
      concerning the billed amount can be resolved. location information
      might help to resolve the dispute.  The user might, for example,
      be able to show that he has never been at the indicated place.

   o  If the policy rules provided by the user indicate that location
      information must not be distributed at all then the home network
      MUST provide the Basic-Policy-Rules to the RADIUS entity in the
      visited network via an Access-Accept, the Access-Reject and the
      Access-Challenge message.  The RADIUS server in the user's home
      network would set the 'Retention-Expires' and the 'Retransmission-
      allowed' field to the user indicated value.

   For the envisioned usage scenarios, the identity of the user and his
   device is tightly coupled to the transfer of location information.
   If the identity can be determined by the visited network or AAA
   brokers, then it is possible to correlate location information with a
   particular user.  As such, it allows the visited network and brokers
   to learn movement patterns of users.

   The identity of the user can "leak" to the visited network or AAA
   brokers in a number of ways:

   o  The user's device may employ a fixed MAC address, or base its IP
      address on such an address.  This enables the correlation of the
      particular device to its different locations.  Techniques exist to
      avoid the use of an IP address that is based on MAC address [22].
      Some link layers make it possible to avoid MAC addresses or change
      them dynamically.

   o  Network access authentication procedures such as PPP CHAP [23] or
      EAP [24] may reveal the user's identity as a part of the
      authentication procedure.  Techniques exist to avoid this problem
      in EAP, for instance by employing private Network Access
      Identifiers (NAIs) in the EAP Identity Response message [25] and
      by method-specific private identity exchange in the EAP method
      (e.g., [26], [27], [28]).  Support for identity privacy within
      CHAP is not available.

   o  AAA protocols may return information from the home network to the
      visited in a manner that makes it possible to either identify the



Tschofenig, et al.      Expires September 7, 2006              [Page 45]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


      user or at least correlate his session with other sessions, such
      as the use of static data in a Class attribute [1] or in some
      accounting attribute usage scenarios [29].

   o  Mobility mechanisms may reveal some permanent identifier (such as
      a home address) in cleartext in the packets relating to mobility
      signaling.

   o  Application protocols may reveal other permanent identifiers.

   Note that to prevent the correlation of identities with location
   information it is necessary to prevent leakage of identity
   information from all sources, not just one.

   Unfortunately, most users are not educated about the importance of
   identity confidentiality and there is a lack of support for it in
   many protocols.  This problem is made worse by the fact that the
   users may be unable to choose particular protocols, as the choice is
   often dictated by the type of network they wish to access, the kind
   of equipment they have, or the type of authentication method they are
   using.

   A scenario where the user is attached to the home network is, from a
   privacy point of view, simpler than a scenario where a user roams
   into a visited network since the NAS and the home AAA are in the same
   administrative domain.  No direct relationship between the visited
   and the home network operator may be available and some AAA brokers
   need to be consulted.  With subscription-based network access as used
   today the user has a contractual relationship with the home network
   provider which could allow higher privacy considerations to be
   applied (including policy rules stored at the home network itself for
   the purpose of restricting further distribution).

   In many cases it is necessary to secure the transport of location
   information along the RADIUS infrastructure.  Mechanisms to achieve
   this functionality are discussed in Section 14.















Tschofenig, et al.      Expires September 7, 2006              [Page 46]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


14.  Security Considerations

   Requirements for the protection of a Location Object are defined in
   [12]: Mutual end-point authentication, data object integrity, data
   object confidentiality and replay protection.  The distribution of
   location information can be restricted with the help of authorization
   policies.  Basic authorization policies are attached to the location
   information itself, in the same fashion as described in [15].  It is
   possible that the user was already able to transfer some
   authorization policies to the access network to restrict the
   distribution of location information.  This is, however, rather
   unlikely in case of roaming users.  Hence, it will be primarily the
   NAS creating the Location Object which also sets the authorization
   policies.  If no authorization information is provided by the user
   then the visited network MUST set the authorization policies to only
   allow the home AAA server to use the provided location information.
   Other entities, such as the visited network and possibly AAA brokers
   MUST NOT use the location information for a purpose other than
   described in this document.  More extensible authorization policies
   can be stored at the user's home network.  These policies are useful
   when location information is distributed to other entities in a
   location-based service.  This scenario is, however, outside the scope
   of this document.

   It is necessary to use authorization policies to limit the
   unauthorized distribution of location information.  The security
   requirements which are created based on [12] are inline with threats
   which appear in the relationship with disclosure of location
   information as described in [30].  PIDF-LO [15] proposes S/MIME to
   protect the Location Object against modifications.  S/SIME relies on
   public key cryptography which raises performance, deployment and size
   considerations.  Encryption would require that the local AAA server
   or the NAS knows the recipient's public key (e.g., the public key of
   the home AAA server).  Knowing the final recipient of the location
   information is in many cases difficult for RADIUS entities.  Some
   sort of public key infrastructure would be required to obtain the
   public key and to verify the digital signature (at the home network).
   Providing per-object cryptographic protection is, both at the home
   and at the visited network, computationally expensive.

   If no authentication, integrity and replay protection between the
   participating RADIUS entities is provided then an adversaries can
   spoof and modify transmitted attributes.  Two security mechanisms are
   proposed for RADIUS:

   o  [1] proposes the usage of a static key which might raise some
      concerns about the lack dynamic key management.




Tschofenig, et al.      Expires September 7, 2006              [Page 47]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   o  RADIUS over IPsec [31] allows to run standard key management
      mechanisms, such as KINK [32], IKE and IKEv2 [33], to establish
      IPsec security associations.  Confidentiality protection MUST be
      used to prevent eavesdropper gaining access to location
      information.  Confidentiality protection is not only a property
      required by this document, it is also required for the transport
      of keying material in the context of EAP authentication and
      authorization.  Hence, this requirement is, in many environments,
      already fulfilled.  Mutual authentication must be provided between
      the local AAA server and the home AAA server to prevent man-in-
      the-middle attacks from being successful.  This is another
      requirement raised in the area of key transport with RADIUS and
      does not represent a deployment obstacle.  The performance
      advantages superior compared to the usage of S/MIME and object
      security since the expensive authentication and key exchange
      protocol run needs to be provided only once (for a long time).
      Symmetric channel security with IPsec is highly efficient.  Since
      IPsec protection is suggested as a mechanism to protect RADIUS
      already no additional considerations need to be addressed beyond
      those described in [31].  Where an untrusted AAA intermediary is
      present, the Location Object MUST NOT be provided to the
      intermediary.

   In case that IPsec protection is not available for some reason and
   RADIUS specific security mechanisms have to be used then the
   following considerations apply.  The Access-Request message is not
   integrity protected.  This would allow an adversary to change the
   contents of the Location Object or to insert and modify attributes
   and fields or to delete attributes.  To address these problems the
   Message-Authenticator (80) can be used to integrity protect the
   entire Access-Request packet.  The Message-Authenticator (80) is also
   required when EAP is used and hence is supported by many modern
   RADIUS servers.

   Access-Request packets including Location attribute(s) without a
   Message-Authenticator(80) attribute SHOULD be silently discarded by
   the RADIUS server.  A RADIUS server supporting the Location
   attributes MUST calculate the correct value of the Message-
   Authenticator(80) and MUST silently discard the packet if it does not
   match the value sent.

   Access-Accept, including Location attribute(s) without a Message-
   Authenticator(80) attribute SHOULD be silently discarded by the NAS.
   A NAS supporting the Location attribute MUST calculate the correct
   value of a received Message-Authenticator(80) and MUST silently
   discard the packet if it does not match the value sent.

   RADIUS and Diameter make some assumptions about the trust between



Tschofenig, et al.      Expires September 7, 2006              [Page 48]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   traversed AAA entities in sense that object level security is not
   provided by neither RADIUS nor Diameter.  Hence, some trust has to be
   placed on the AAA entities to behave according to the defined rules.
   Furthermore, the AAA protocols do not involve the user in their
   protocol interaction except for tunneling authentication information
   (such as EAP messages) through their infrastructure.  RADIUS and
   Diameter have even become a de-facto protocol for key distribution.
   Hence, in the past there were some concerns about the trust placed
   into the infrastructure particularly from the security area when it
   comes to keying.  The EAP keying infrastructure is described in [24].









































Tschofenig, et al.      Expires September 7, 2006              [Page 49]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


15.  IANA Considerations

   The authors request that the Attribute Types, and Attribute Values
   defined in this document be registered by the Internet Assigned
   Numbers Authority (IANA) from the RADIUS name spaces as described in
   the "IANA Considerations" section of RFC 3575 [10], in accordance
   with BCP 26 [11].  Additionally, the Attribute Type should be
   registered in the Diameter name space.

   This document defines the following attributes:

         Operator-Name
         Location-Information
         Basic-Policy-Rules
         Extended-Policy-Rules
         Challenge-Capable
         Requested-Info

   Please refer to Section 10 for the registered list of numbers.

   This document also instructs IANA to assign a new value for the
   Error-Cause attribute [5], of "Location-Info-Required" TBA.

   Additionally, IANA is requested to create the following new
   registries:

15.1.  New Registry: Operator Type

   This document also defines an operator namespace registry (used in
   the Namespace field of the Operator-Name attribute).  Initially, IANA
   is requested to register the following attribues: identifier and
   operator-namespace / associated registry owners for the operator
   namespace:

       +----------+--------------------------------------+
       |Identifier| Operator-Namespace / Registry Owner  |
       +----------+--------------------------------------+
       |    0     | GSM - GSM Association/TADIG WG       |
       |    1     | CDMA - IMSI Oversight Council        |
       |    2     | REALM - IANA or delegate             |
       |    3     | ITU - ITU-T/TSB                      |
       +----------+--------------------------------------+

   Following the policies outline in [11] new values to the Operator-
   Namespaces will be assigned after Expert Review by the Geopriv
   working group or its designated successor.  Updates can be provided
   based on expert approval only.  No mechanism to mark entries as
   "deprecated" is envisioned.  Based on expert approval it is possible



Tschofenig, et al.      Expires September 7, 2006              [Page 50]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   to delete entries from the registry.

15.2.  New Registry: Requested-Info attribute

   This document creates a new IANA registry for the Requested-Info
   attribute.  Currently four info elements are defined, as shown in
   Section 7

   Following the policies outline in [10] new values for usage with the
   Requested-Info attribute will be assigned after Expert Review by the
   RADEXT working group or its designated successor.  Updates can be
   provided based on expert approval only.  A designated expert will be
   appointed by the O&M Area Directors.  No mechanism to mark entries as
   "deprecated is envisioned.  Based on expert approval it is possible
   to delete entries from the registry.

   Each registration must include the name of the info element, a brief
   description and a numerical value respresenting a bit in the bit-
   string:

   Name:

      Identifier of the capability


   Description:

      Brief description indicating the meaning of the info element.


   Numerical Value:

      A numerical value that is placed into the Capability attribute.


















Tschofenig, et al.      Expires September 7, 2006              [Page 51]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


16.  Acknowledgments

   The authors would like to thank the following people for their help
   with a previous version of this draft and for their input:

      Chuck Black

      Paul Congdon

      Jouni Korhonen

      Sami Ala-luukko

      Farooq Bari

      Ed Van Horne

      Mark Grayson

      Jukka Tuomi

      Jorge Cuellar

      Christian Guenther

   Henning Schulzrinne provided the civic location information content
   found in this draft.  The geospatial location information format is
   based on work done by J. Polk, J. Schnizlein and M. Linsner.  The
   authorization policy format is based on the work done by Jon
   Peterson.

   The authors would like to thank Victor Lortz, Jose Puthenkulam,
   Bernrad Aboba, Jari Arkko, Parviz Yegani, Serge Manning, Kuntal
   Chowdury, Pasi Eronen, Blair Bullock and Eugene Chang for their
   feedback to an initial version of this draft.  We would like to thank
   Jari Arkko for his text contributions.  Lionel Morand provided
   detailed feedback on numerous issues.  His comments helped to improve
   the quality of this document.  Jouni Korhonen and John Loughney
   helped us with the Diameter RADIUS interoperability.  Andreas
   Pashalidis reviewed the final document and provided a number of
   comments.  Bernard Aboba, Alan DeKok, Lionel Morand, Jouni Korhonen,
   David Nelson and Emile van Bergen provided guidance on the Requested-
   Info attribute and participated in the capability exchange
   discussions.

   This document is based on the discussions within the IETF GEOPRIV
   working group.  Therefore, the authors thank Henning Schulzrinne,
   James Polk, John Morris, Allison Mankin, Randall Gellens, Andrew



Tschofenig, et al.      Expires September 7, 2006              [Page 52]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   Newton, Ted Hardie, Jon Peterson for their time to discuss a number
   of issues with us.  We thank Stephen Hayes for aligning this work
   with 3GPP activities.
















































Tschofenig, et al.      Expires September 7, 2006              [Page 53]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


17.  References

17.1.  Normative References

   [1]   Rigney, C., Willens, S., Rubens, A., and W. Simpson, "Remote
         Authentication Dial In User Service (RADIUS)", RFC 2865,
         June 2000.

   [2]   Bradner, S., "Key words for use in RFCs to Indicate Requirement
         Levels", March 1997.

   [3]   Rigney, C., "RADIUS Accounting", RFC 2866, June 2000.

   [4]   Schulzrinne, H., "Dynamic Host Configuration Protocol (DHCPv4
         and DHCPv6) Option for Civic  Addresses Configuration
         Information", draft-ietf-geopriv-dhcp-civil-09 (work in
         progress), January 2006.

   [5]   Chiba, M., Dommety, G., Eklund, M., Mitton, D., and B. Aboba,
         "Dynamic Authorization Extensions to Remote Authentication Dial
         In User Service (RADIUS)", RFC 3576, July 2003.

   [6]   Yergeau, F., "UTF-8, a transformation format of ISO 10646",
         STD 63, RFC 3629, November 2003.

   [7]   Schulzrinne, H. and H. Tschofenig, "Location Types Registry",
         draft-ietf-geopriv-location-types-registry-04 (work in
         progress), February 2006.

   [8]   Polk, J., Schnizlein, J., and M. Linsner, "Dynamic Host
         Configuration Protocol Option for Coordinate-based Location
         Configuration Information", RFC 3825, July 2004.

   [9]   Calhoun, P., Loughney, J., Guttman, E., Zorn, G., and J. Arkko,
         "Diameter Base Protocol", RFC 3588, September 2003.

   [10]  Aboba, B., "IANA Considerations for RADIUS (Remote
         Authentication Dial In User Service)", RFC 3575, July 2003.

   [11]  Narten, T. and H. Alvestrand, "Guidelines for Writing an IANA
         Considerations Section in RFCs", BCP 26, RFC 2434,
         October 1998.

17.2.  Informative References

   [12]  Cuellar, J., Morris, J., Mulligan, D., Peterson, D., and D.
         Polk, "Geopriv Requirements", RFC 3693, February 2004.




Tschofenig, et al.      Expires September 7, 2006              [Page 54]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   [13]  Rosenberg, J., Schulzrinne, H., Camarillo, G., Johnston, A.,
         Peterson, J., Sparks, R., Handley, M., and E. Schooler, "SIP:
         Session Initiation Protocol", RFC 3261, June 2002.

   [14]  Polk, J. and B. Rosen, "Session Initiation Protocol Location
         Conveyance", draft-ietf-sip-location-conveyance-01 (work in
         progress), July 2005.

   [15]  Peterson, J., "A Presence-based GEOPRIV Location Object
         Format", draft-ietf-geopriv-pidf-lo-03 (work in progress),
         September 2004.

   [16]  Schulzrinne, H., "A Document Format for Expressing Privacy
         Preferences", draft-ietf-geopriv-common-policy-07 (work in
         progress), February 2006.

   [17]  Schulzrinne, H., "A Document Format for Expressing Privacy
         Preferences for Location  Information",
         draft-ietf-geopriv-policy-08 (work in progress), February 2006.

   [18]  Calhoun, P., Zorn, G., Spence, D., and D. Mitton, "Diameter
         Network Access Server Application", RFC 4005, August 2005.

   [19]  Mills, D., "Network Time Protocol (Version 3) Specification,
         Implementation", RFC 1305, March 1992.

   [20]  "Open Geography Markup Language (GML) Implementation
         Specification", OGC 02-023r4,
         http://www.opengis.org/techno/implementation.htm",  ,
         January 2003.

   [21]  Stanley, D., Walker, J., and B. Aboba, "Extensible
         Authentication Protocol (EAP) Method Requirements for Wireless
         LANs", RFC 4017, March 2005.

   [22]  Narten, T. and R. Draves, "Privacy Extensions for Stateless
         Address Autoconfiguration in IPv6", RFC 3041, January 2001.

   [23]  Simpson, W., "PPP Challenge Handshake Authentication Protocol
         (CHAP)", RFC 1994, August 1996.

   [24]  Aboba, B., Beadles, M., Arkko, J., and P. Eronen, "The Network
         Access Identifier", RFC 4282, December 2005.

   [25]  Arkko, J. and H. Haverinen, "Extensible Authentication Protocol
         Method for 3rd Generation Authentication and Key Agreement
         (EAP-AKA)", RFC 4187, January 2006.




Tschofenig, et al.      Expires September 7, 2006              [Page 55]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


   [26]  Arkko, J. and H. Haverinen, "Extensible Authentication Protocol
         Method for 3rd Generation Authentication  and Key Agreement
         (EAP-AKA)", draft-arkko-pppext-eap-aka-15 (work in progress),
         December 2004.

   [27]  Josefsson, S., Palekar, A., Simon, D., and G. Zorn, "Protected
         EAP Protocol (PEAP) Version 2",
         draft-josefsson-pppext-eap-tls-eap-10 (work in progress),
         October 2004.

   [28]  Tschofenig, H., "EAP IKEv2 Method",
         draft-tschofenig-eap-ikev2-10 (work in progress),
         February 2006.

   [29]  Adrangi, F., "Chargeable User Identity",
         draft-ietf-radext-chargeable-user-id-06 (work in progress),
         October 2005.

   [30]  Danley, M., "Threat Analysis of the Geopriv Protocol",
         RFC 3694, September 2003.

   [31]  Aboba, B. and P. Calhoun, "RADIUS (Remote Authentication Dial
         In User Service) Support For Extensible Authentication Protocol
         (EAP)", RFC 3579, September 2003.

   [32]  Sakane, S., "Kerberized Internet Negotiation of Keys (KINK)",
         draft-ietf-kink-kink-11 (work in progress), December 2005.

   [33]  Kaufman, C., "Internet Key Exchange (IKEv2) Protocol",
         RFC 4306, December 2005.

   [34]  Aboba, B., "The Network Access Identifier",
         draft-arkko-roamops-rfc2486bis-02 (work in progress),
         July 2004.

















Tschofenig, et al.      Expires September 7, 2006              [Page 56]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


Authors' Addresses

   Hannes Tschofenig
   Siemens
   Otto-Hahn-Ring 6
   Munich, Bavaria  81739
   Germany

   Email: Hannes.Tschofenig@siemens.com


   Farid Adrangi
   Intel Corporatation
   2111 N.E. 25th Avenue
   Hillsboro OR
   USA

   Email: farid.adrangi@intel.com


   Mark Jones
   Bridgewater Systems Corporation
   303 Terry Fox Drive
   Ottawa, Ontario  K2K 3J1
   CANADA

   Email: mark.jones@bridgewatersystems.com


   Avi Lior
   Bridgewater Systems Corporation
   303 Terry Fox Drive
   Ottawa, Ontario  K2K 3J1
   CANADA

   Email: avi@bridgewatersystems.com















Tschofenig, et al.      Expires September 7, 2006              [Page 57]

Internet-Draft     Carrying Location Objects in RADIUS        March 2006


Intellectual Property Statement

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Disclaimer of Validity

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY AND THE INTERNET
   ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS OR IMPLIED,
   INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF THE
   INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Copyright Statement

   Copyright (C) The Internet Society (2006).  This document is subject
   to the rights, licenses and restrictions contained in BCP 78, and
   except as set forth therein, the authors retain all their rights.


Acknowledgment

   Funding for the RFC Editor function is currently provided by the
   Internet Society.




Tschofenig, et al.      Expires September 7, 2006              [Page 58]


